{
  "Researcher Profile:": "Dr. Kara De Leon",
  "Affiliation:": "School of Biological Sciences, University of Oklahoma",
  "Research Domains": [
    "Environmental Microbiology",
    "Epidemiology",
    "Molecular Biology",
    "Genetics",
    "Wastewater-based Epidemiology (WBE)",
    "Bacteriology",
    "Virology",
    "Public Health Surveillance",
    "Biostatistics",
    "Environmental Engineering"
  ],
  "Techniques Used": [
    "Quantitative Polymerase Chain Reaction (qPCR)",
    "Reverse Transcriptase qPCR (RT-qPCR)",
    "Next-Generation Sequencing (NGS)",
    "Environmental Sampling (Wastewater, Water, Sediment)",
    "Nucleic Acid Extraction and Concentration",
    "Statistical Analysis (Time Series Analysis, Cross-correlation Matrix, Fisher’s Exact Test, Univariate and Multivariate Modeling)",
    "Bacterial Culture and Phenotypic Methods (Biolog, Kirby-Bauer antibiotic disc assay)",
    "Transposon Mutagenesis",
    "Loop-mediated Isothermal Amplification (LAMP)"
  ],
  "Data & Platforms": [
    "Public Datasets: Oklahoma Wastewater Surveillance Data, RB-TnSeq Mutant Library (DvH JW710), GenBank (GCF_000195755.1, NC_002937.3, NC_005863.1), Oklahoma State Department of Health (OSDH) Notification System (PHIDDO)","Platforms: R programming language, Fitness Browser, Stata 17, Frejya 1.4.2"
  ],
  "Application Areas": [
    "Early Warning Systems for Infection Disease Outbreaks",
    "Community Disease Burden Assessment",
    "Monitoring SARS-CoV-2 Variants and Transmission",
    "Antimicrobial Resistance (AMR) Surveillance",
    "Environmental Quality Monitoring",
    "Genomic Research"
  ],
  "Key Research Thinking Patterns": [
    "Comparative Analysis: Systematically examines similarities and differences between two or more entities (datasets, methodologies, biological samples) to gain deeper insights or validate findings (e.g., Comparing gene set of Desulfovibrio vulgaris Hildenborough to Database of Essential Genes).",
    "Correlation and Prediction: Identifies relationships or associations between variables to understand their interplay, forecast future trends, or infer unobserved phenomena (e.g., Correlation of Campylobacter concentrations in wastewater with Salmonella concentrations).",
    "Data-Driven Discovery: Utilizes large or complex datasets to uncover novel insights, identify unknown patterns, or reveal phenomena (e.g., studying statewide wastewater surveillance program for 18 months).",
    "Interdisciplinary Approach: Involved in integrating knowledge, methods, and perspectives from multiple distinct academic disciplines to address a research problem more comprehensively (e.g., wastewater surveillance program involves Biostatistics and Epidemiology, Civil Engineering, Public Health, Medical Research, Biological Sciences, and Earth Sciences)."
  ],
  "Summary Description": "Kara B. De León is a distinguished researcher in environmental microbiology and public health, specializing in microbial community analysis and pathogen surveillance. Her work integrates laboratory techniques with advanced genomics to understand bacterial characteristics and detect viral presence in environmental samples like wastewater. De León's research provides data-driven insights into bacterial physiology, SARS-CoV-2 variant dynamics, and the monitoring of gastrointestinal pathogens and fecal indicator bacteria in freshwater environments."
}